{"config": [{"config": {"trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "dtype": "float32", "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "units": 100, "unroll": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "dropout": 0.0, "batch_input_shape": [null, 40, 3], "activation": "tanh", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "go_backwards": false, "stateful": false, "recurrent_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 6, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}